# Normal Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..Normal Property
Ellipse Class See Also
---
Returns the normal to the plane in which the ellipse is defined.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Normal { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Normal As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Normal {
	XYZ^ get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace